[
  {
    "fileName": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fbjj-world.com%2Fwp-content%2Fuploads%2F2018%2F06%2Farmbar1.jpg&f=1&nofb=1&ipt=c9ba762eb59e82ef96b0c9b20e5cb9e54b7f43f2257d987f8c6636198487091a&ipo=images",
    "caption": "ambar",
    "gi": "false",
    "description": "The armbar, or arm lock, is a joint lock that hyperextends the elbow joint and is the most common joint lock used as a submission. The armbar is usually accomplished by placing the opponent's extended arm in between both of the practitioner's legs, and then controlling the opponent's body by holding the wrist of the opponent's arm closer to his/her body. The practitioner then places their hips in the air, and uses their body weight to apply pressure to the opponent's elbow. The practitioner can also use their hands to hold onto their own wrist for extra pressure. The opponent will tap out when they are in pain, or when their arm is about to break.",
    "difficulty": "easy"
  },
  {
    "fileName": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.explicit.bing.net%2Fth%3Fid%3DOIP.jAyJ2BqqWenege3gX0jJ7AHaEk%26pid%3DApi&f=1&ipt=9912ae4f8c7db958b7ef28878545e46bfbdd6201e1d28a0bc988677504f525d9&ipo=images",
    "caption": "Rear Naked Choke",
    "gi": "false",
    "description": "The rear naked choke is a chokehold in martial arts applied from an opponent's back. Depending on the context, the term may refer to one of two variations of the technique, either arm can be used to apply the choke in both cases. The term rear naked choke likely originated from the technique in Jujutsu and Judo known as the \"Hadaka Jime\", or \"Naked Strangle\" in English. The word \"naked\" in this context suggests that, unlike other strangulation techniques found in Jujutsu/Judo/MMA, this hold does not require the use of a keikogi (gi) or training uniform.",
    "difficulty": "easy"
  },
  {
    "fileName": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fwww.bjjee.com%2Fwp-content%2Fuploads%2F2021%2F06%2Ffinal_60dca46559dd31006ad7a6bc_886395-1.png&f=1&nofb=1&ipt=42f9ca62061c47a730b80f231968f1d46c93306089e74e55c80f32e61e762dab&ipo=images",
    "caption": " Ezekiel Choke",
    "gi": "true",
    "description": "The Ezekiel choke is a chokehold in Brazilian jiu-jitsu, judo, sambo, and mixed martial arts which strangles the opponent by compressing the trachea and carotid arteries using the attacker's sleeve or lapel. The technique is typically applied from the front of the opponent, seated between his/her legs. The choke can also be applied from the back, using the opponent's collar. The Ezekiel choke is named after Ezequiel Paraguassu, a judoka who used the technique extensively in competition.",
    "difficulty": "easy"
  },

  {
    "fileName": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fbjjmoves.com%2Fwp-content%2Fuploads%2F2016%2F03%2FAmericana-arm-lock-jiu-jitsu-move-5.jpg&f=1&nofb=1&ipt=7a3cc841c970277c332f8e25279fcfa40c1afdbed3f245ea42b522be2863b338&ipo=images",
    "caption": "Americana Armlock",
    "gi": "false",
    "description": "The Americana, also called a keylock or figure four armlock in catch wrestling, or ude garami in judo, is a common grappling submission consisting of the attacker controlling his opponent's arm (bent in an \"L\" shape), by using a clever double wrist control. The attacker then uses his/her own arms to create a lever which applies pressure on the shoulder of the opponent. The name Americana is derived from the American Judo team winning a match with the lock, and the name stuck.",
    "difficulty": "easy"
  },
  {
    "fileName": "https://www.bjjee.com/wp-content/uploads/2022/10/Clock-Choke-by-John-Danaher.jpg",
    "caption": "clock choke",
    "gi": "true",
    "description": " this is when you are on your back and you have your arms wrapped around your opponents neck and you are choking them out.",
    "difficulty": "hard"
  },
  {
    "fileName": "https://upload.wikimedia.org/wikipedia/commons/d/db/USMC-091229-M-3661M-011.jpg",
    "caption": "guillotine",
    "gi": "false",
    "description": " this is when you are on your back and you have your arms wrapped around your opponents neck and you are choking them out.",
    "difficulty": "medium"
  }
]
